CristianoGorla/guition-jc1060p470c-bsp-full-feature-demo/sdkconfig.defaults
# Guition JC1060P470C - Base Configuration (All Chips)

# === BSP Configuration ===
CONFIG_BSP_ENABLE_DISPLAY_JD9165=y
CONFIG_BSP_ENABLE_I2C=y
CONFIG_BSP_ENABLE_TOUCH=y
CONFIG_BSP_ENABLE_AUDIO=y
CONFIG_BSP_ENABLE_RTC=y
CONFIG_BSP_ENABLE_SDIO=y
CONFIG_BSP_ENABLE_WIFI=y
CONFIG_BSP_ENABLE_SDCARD=y

# === BSP LVGL Graphics Library ===
CONFIG_BSP_ENABLE_LVGL=y
# Display buffer configuration (100 lines = ~246KB per buffer)
CONFIG_BSP_LVGL_BUFFER_LINES=100
CONFIG_BSP_LVGL_DOUBLE_BUFFER=y
CONFIG_BSP_LVGL_USE_DMA_BUFFER=y
CONFIG_BSP_LVGL_USE_SPIRAM=n
# Software rotation support
CONFIG_BSP_LVGL_ENABLE_SW_ROTATE=y
CONFIG_BSP_LVGL_ROTATION_0=y
CONFIG_BSP_LVGL_ROTATION_90=n
CONFIG_BSP_LVGL_ROTATION_180=n
CONFIG_BSP_LVGL_ROTATION_270=n
# Touch input
CONFIG_BSP_LVGL_TOUCH_ENABLE=y
# Demo applications (enable for testing)
CONFIG_BSP_LVGL_ENABLE_DEMO=y
CONFIG_BSP_LVGL_DEMO_SIMPLE=y
CONFIG_BSP_LVGL_DEMO_WIDGETS=n
CONFIG_BSP_LVGL_DEMO_BENCHMARK=n
CONFIG_BSP_LVGL_DEMO_STRESS=n

# === System ===
CONFIG_IDF_TARGET="esp32p4"

# === Flash Configuration ===
# Board uses Boya 16MB flash - requires explicit config
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE_CHECK=y
CONFIG_SPI_FLASH_BYPASS_CHIP_DRIVER_SELECTION=n

# === Chip Revision ===
# Target ESP32-P4 v1.3 (revisions < 3.0)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP_REV_MIN_FULL=103
CONFIG_ESP_REV_MIN=103

# === PSRAM Configuration ===
# Board has 32MB octal PSRAM @ 200MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# XIP (Execute In Place) from PSRAM for code optimization
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# === NVS ===
CONFIG_NVS_ENCRYPTION=n

# === Partition Table ===
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# === Compiler Options ===
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2

# === Stack Protection ===
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
CONFIG_COMPILER_STACK_CHECK=y

# === Memory ===
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# === ESP System Settings ===
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# === Logging ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5
CONFIG_LOG_COLORS=y

# === LCD/Display ===
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
# Allocate LCD framebuffer in PSRAM
CONFIG_BSP_LCD_DSI_USE_PSRAM=y

# === LVGL v9.2.2 Configuration ===
# LVGL Memory Management (use ESP-IDF heap)
CONFIG_LV_MEM_CUSTOM=y
# L2 Cache Size (256KB for smooth 1024x600)
CONFIG_CACHE_L2_CACHE_256KB=y
# PPA (Pixel Processing Accelerator) for rotation
CONFIG_ESP_LCD_PPA_ENABLE=y
# esp_lvgl_port task configuration
CONFIG_LV_PORT_TASK_STACK_SIZE=6144
CONFIG_LV_PORT_TASK_PRIORITY=4

# === LVGL Fonts (Montserrat) ===
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y

# === FATFS (SD Card) ===
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_CODEPAGE_850=y

# === LWIP (Network Stack) ===
CONFIG_LWIP_LOCAL_HOSTNAME="guition-jc1060"
CONFIG_LWIP_NETIF_LOOPBACK=y
CONFIG_LWIP_LOOPBACK_MAX_PBUFS=8

# === SD/MMC Power Control ===
# SD card uses external MOSFET (GPIO36), not internal LDO
CONFIG_EXAMPLE_SD_PWR_CTRL_LDO_INTERNAL_IO=n

# === ESP-Hosted (WiFi) ===
CONFIG_ESP_HOSTED_TRANSPORT_SDIO=y
CONFIG_ESP_HOSTED_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_TRANSPORT_SPI=n
# C6 SDIO communication requires LDO4 @ 3.3V
CONFIG_ESP_HOSTED_SD_PWR_CTRL_LDO_INTERNAL_IO=y
CONFIG_ESP_HOSTED_SDIO_LDO_CHANNEL_ID=4
CONFIG_ESP_HOSTED_SDIO_LDO_VOLTAGE=3300

# === ESP-Hosted Reset Strategy ===
# CRITICAL: Force C6 reset on EVERY P4 boot to prevent boot loops
# Conditional reset causes boot loops because C6 maintains state across
# P4 software resets. See docs/ESP_HOSTED_RESET_STRATEGIES.md for details.
CONFIG_ESP_HOSTED_RESET_SLAVE_ON_INIT=y
CONFIG_ESP_HOSTED_RESET_SLAVE_IF_NEEDED=n

# === WiFi Configuration ===
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# === SDMMC Configuration ===
CONFIG_SDMMC_HOST_ALLOC_ALIGNED_BUF=y

# === GPIO Configuration ===
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y

# === I2C Configuration ===
CONFIG_I2C_ENABLE_DEBUG_LOG=n
